# PE06 Hrishikesh Vaze

In [1]:
import pandas as pd
import numpy as np

In [2]:
#creating dataframes

data1 = [
    ['T1', ['Hotdogs', 'Buns', 'Ketchup']], 
    ['T2', ['Hotdogs', 'Buns']], 
    ['T3', ['Hotdogs', 'Coke', 'Chips']],
    ['T4', ['Chips', 'Coke']],
    ['T5', ['Chips', 'Ketchup']],
    ['T6', ['Hotdogs', 'Coke','Chips']],
]
df1 = pd.DataFrame(data1, columns=['Transaction ID', 'Items'])
df1

  Transaction ID                     Items
0             T1  [Hotdogs, Buns, Ketchup]
1             T2           [Hotdogs, Buns]
2             T3    [Hotdogs, Coke, Chips]
3             T4             [Chips, Coke]
4             T5          [Chips, Ketchup]
5             T6    [Hotdogs, Coke, Chips]

In [3]:
# creating dataframes

ds2_col1 = [1,2,3,4,5]
ds2_col2 = [
    ['Bread', 'Milk'],
    ['Bread', 'Diapers', 'Beer', 'Eggs'],
    ['Milk', 'Diapers', 'Beer', 'Cola'],
    ['Bread', 'Milk', 'Diapers', 'Beer'],
    ['Bread', 'Milk', 'Diapers', 'Cola']
]

df2 = pd.DataFrame({'ID': ds2_col1, 'Items': ds2_col2}, index=None)
df2

   ID                         Items
0   1                 [Bread, Milk]
1   2  [Bread, Diapers, Beer, Eggs]
2   3   [Milk, Diapers, Beer, Cola]
3   4  [Bread, Milk, Diapers, Beer]
4   5  [Bread, Milk, Diapers, Cola]

In [4]:
# loading online retail
online_retail = pd.read_csv('../datasets/OnlineRetail.csv')
online_retail.head(n=2)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/10 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/10 8:26,3.39,17850.0,United Kingdom

In [5]:
# columns in dataset
online_retail.columns

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country'],
      dtype='object')

In [6]:
# check if there is any null values or not
online_retail.isnull().values.any()

True

In [7]:
online_retail.isnull().sum()

InvoiceNo           0
StockCode           0
Description      1454
Quantity            0
InvoiceDate         0
UnitPrice           0
CustomerID     135080
Country             0
dtype: int64

In [8]:
# ignoring null values in customer id and description
online_retail = online_retail[online_retail['CustomerID'].notnull() & online_retail['Description'].notnull()]

In [9]:
# strip Description column
online_retail['Description'] = online_retail['Description'].str.strip()

In [10]:
# drop rows with null values in Invoice number
online_retail = online_retail[online_retail['InvoiceNo'].notnull()]

In [11]:
# drop all transaction which were done on credit
# online_retail = online_retail[online_retail]

In [12]:
# showing all countries , using SET
set(online_retail['Country'].values.tolist())

{'Australia',
 'Austria',
 'Bahrain',
 'Belgium',
 'Brazil',
 'Canada',
 'Channel Islands',
 'Cyprus',
 'Czech Republic',
 'Denmark',
 'EIRE',
 'European Community',
 'Finland',
 'France',
 'Germany',
 'Greece',
 'Iceland',
 'Israel',
 'Italy',
 'Japan',
 'Lebanon',
 'Lithuania',
 'Malta',
 'Netherlands',
 'Norway',
 'Poland',
 'Portugal',
 'RSA',
 'Saudi Arabia',
 'Singapore',
 'Spain',
 'Sweden',
 'Switzerland',
 'USA',
 'United Arab Emirates',
 'United Kingdom',
 'Unspecified'}

In [13]:
# split set according to region of transaction

In [14]:
# transaction in France
online_retail_france = online_retail[online_retail['Country'] == 'France']
online_retail_france

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
26,536370,22728,ALARM CLOCK BAKELIKE PINK,24,12/1/10 8:45,3.75,12583.0,France
27,536370,22727,ALARM CLOCK BAKELIKE RED,24,12/1/10 8:45,3.75,12583.0,France
28,536370,22726,ALARM CLOCK BAKELIKE GREEN,12,12/1/10 8:45,3.75,12583.0,France
29,536370,21724,PANDA AND BUNNIES STICKER SHEET,12,12/1/10 8:45,0.85,12583.0,France
30,536370,21883,STARS GIFT TAPE,24,12/1/10 8:45,0.65,12583.0,France
...,...,...,...,...,...,...,...,...
541904,581587,22613,PACK OF 20 SPACEBOY NAPKINS,12,12/9/11 12:50,0.85,12680.0,France
541905,581587,22899,CHILDREN'S APRON DOLLY GIRL,6,12/9/11 12:50,2.10,12680.0,France
541906,581587,23254,CHILDRENS CUTLERY DOLLY GIRL,4,12/9/11 12:50,4.15,12680.0,France
541907,581587,23255,CHILDRENS CUTLERY CIRCUS PARADE,4,12/9/11 12:50,4.15,12680.0,France
541908,581587,22138,BAKING SET 9 PIECE RETROSPOT,3,12/9/11 12:50,4.95,12680.0,France